/**
【题目描述】
某医院想统计一下某项疾病的获得与否与年龄是否有关，需要对以前的诊断记录进行整理，按照0-18、19-35、36-60、61以上（含61）四个年龄段统计的患病人数占总患病人数的比例。

【输入】
共2行，第一行为过往病人的数目n（0<n≤100)，第二行为每个病人患病时的年龄。

【输出】
按照0-18、19-35、36-60、61以上(含61)四个年龄段输出该段患病人数占总患病人数的比例，以百分比的形式输出，精确到小数点后两位。每个年龄段占一行，共四行。

【输入样例】
10
1 11 21 31 41 51 61 71 81 91

【输出样例】
20.00%
20.00%
20.00%
40.00%

思路:
几个疾病年龄个数n，用于输入 第二行为n个年龄，用于判断属于哪一类
每个年龄段所占的百分比
将每个年龄判断后存入对应年龄段的数组中，最后把每个年龄段除以总个数即可
**/
#include <iostream>
using namespace std;
int n;
double a[5];
double cnt;
int main()
{
	scanf("%d", &n);
	int x;
	for (int i = 1; i <= n; i++)
	{
		scanf("%d", &x);
		cnt++;
		if (x >= 0 && x <= 18)
		{
			a[1]++;
		}
		else if (x >= 19 && x <= 35)
		{
			a[2]++;
		}
		else if (x >= 36 && x <= 60)
		{
			a[3]++;
		}
		else
			a[4]++;
	}
	for (int i = 1; i <= 4; i++)
	{
		printf("%.2lf%\n", a[i] / cnt * 100);
	}
	return 0;
}