/**
描述
将一个数组中的值按逆序重新存放。例如，原来的顺序为8,6,5,4,1。要求改为1,4,5,6,8。
输入
输入为两行：第一行数组中元素的个数n（1<n<100)，第二行是n个整数，每两个整数之间用空格分隔。
输出
输出为一行：输出逆序后数组的整数，每两个整数之间用空格分隔。
样例输入
5
8 6 5 4 1
样例输出
1 4 5 6 8
**/
//思路:交换头尾变量,直到n/2为止

#include <stdio.h>
#define N 5
int main()
{
    int a[N], i, t;//t中间变量
    printf("请输入数据：\n");
    for (i = 0; i < N; i++)
        scanf("%d", &a[i]);
    printf("原来的顺序是:\n");
    for (i = 0; i < N; i++)
        printf("%d ", a[i]);
    printf("\n");
    for (i = 0; i < N / 2; i++)
    {
        t = a[i];
        a[i] = a[N - 1 - i];
        a[N - 1 - i] = t;
    }
    printf("现在的顺序是:\n");
    for (i = 0; i < N; i++)
        printf("%d ", a[i]);
}