//枚举算法
/**
题目：任务描述：
我国古代数学家张丘建在《算经》中出了一道题“鸡翁一，值钱五；鸡母一，值钱三；鸡雏三，
值钱一。百钱买百鸡，问鸡翁、鸡母、鸡雏各几何？”，现在假定各鸡种的价格不变，拥有的
钱数为m，需要购买的鸡数为n，试求出所有可能的购买方案总数。
 输 入：
每行对应一个测试样例，每一行包含2个数字，分别为n 和m 。
输 出：
每组测试样例的结果输出占一行，输出可能购买方案总数。
**/
//题解:此处的枚举对象变为 三种鸡 但注意因为三种鸡的数量线性相关
//故可以优化，复杂度，对于普通的解法复杂度为O(n3),采用这个复杂度变为O(n2)
#include <stdio.h>
int main(void)
{
    int N, M, n1, n2, n3, iCount = 0;
    scanf("%d%d", &N, &M);
    iCount = 0;
    for (n1 = 0; n1 <= M / 5; n1++)
        for (n2 = 0; n2 <= M / 3; n2++)
        { //枚举对象二元组
            n3 = N - n1 - n2;
            if (5 * n1 + 3 * n2 + n3 / 3.0 == M) //验证,注意是3.0，不是3
                iCount++;
        }
    printf("%d\r\n", iCount);
    return 0;
}