
/**
例题二：最长上升子序列(百练2757)
问题描述
一个数的序列ai，当a1 < a2 < ... < aS的时候，我们称这个序
列是上升的。对于给定的一个序列(a1, a2, ..., aN)，我们可以得到
一些上升的子序列(ai1, ai2, ..., aiK)，这里1 <= i1 < i2 < ... < iK 
<= N。比如，对于序列(1, 7, 3, 5, 9, 4, 8)，有它的一些上升子
序列，如(1, 7), (3, 4, 8)等等。这些子序列中最长的长度是4，比
如子序列(1, 3, 5, 8). 
你的任务，就是对于给定的序列，求出最长上升子序列的长度。
41
输入数据
输入的第一行是序列的长度N (1 <= N <= 1000)。第二行给
出序列中的N个整数，这些整数的取值范围都在0到10000。
输出要求
最长上升子序列的长度。
输入样例
7
1 7 3 5 9 4 8
输出样例
4

1.找子问题
“求以ak（k=1, 2, 3…N）为终点的最长上升子序列的长度”
一个上升子序列中最右边的那个数，称为该子序列的
“终点”。
虽然这个子问题和原问题形式上并不完全一样，但
是只要这N个子问题都解决了，那么这N个子问题的解中，
最大的那个就是整个问题的解。