//冒泡排序
#include <stdio.h>
int main(void)
{
    int a[100], i, j, t, n;
    scanf("%d", &n);
    for (i = 0; i < n; i++)
        scanf("%d", &a[i]);
    for (i = 0; i < n - 1; i++)         //n个数排序只需要n-1趟
        for (j = 0; j < n - i - 1; j++) //排序一轮n个数只需要n-1次,排序一轮便数据便减少一个
        {
            if (a[j] < a[j + 1]) //比较大小并交换
            {
                t = a[j];
                a[j] = a[j + 1];
                a[j + 1] = t;
            }
        }
    for (i = 0; i < n; i++)
        printf("%d ", a[i]);
}
/*算法分析
冒泡排序一共要进行(n-1)次循环,每一次循环都要进行当前n-1次比较 
所以一共的比较次数是: 
(n-1) + (n-2) + (n-3) + … + 1 = n*(n-1)/2; 
所以冒泡排序的时间复杂度是 O(n2)
*/