/**
递归的思路:
把一个不能或者不好解决的大问题转化为一个或者几个小问题来解决
:再把这些小问题进一步分解为更小的小问题来解决.每个小问题都可以直接解决(此时找到递归的出口)
但是递归不是随意的分解，递归分解要保证“大问题”与小问题的相似，即求解过程与环境的相似

求递归模型的步骤
1.对原问题进行分析,称为大问题，假设出合理的小问题
2.假设小问题可解，在此基础上确定大问题的解,即给出大问题与小问题的之间的关系->递归体
3.确定一个出口->递归出口

eg:假设f(A,i)求数组元素A[0]～A[i]（i+1个元素）中的最小值
假设 F(A,i-1)已经求出 则F(A,i)=MIN(F(A,i-1),A[i])
当i=0时，只有一个元素，有F(A,i)=A[0]
因此
F(A,I)=A[0]      I=0
F(A,I)=MIN(F(A,I-1),A[I]) 其他情况
由此**/
float f(float *A, int i)
{
    float m;
    if (i == 0)
        return A[0]; //递归出口
    else
    {
        m = f(A, i - 1);
        return m > A[i] ? A[i] : m; //递归体
    }
}