/**
荷兰国旗问题：设有一个条块序列，每个条块为红
（0）、白（1）、兰（2）三种颜色中的一种。假设该序列
采用顺序表存储，设计一个时间复杂度为O(n)的算法，使得
这些条块按红、白、兰的顺序排好，即排成荷兰国旗图案。
**/
/**
思路:
用0～i表示0元素区间。
k～n-1表示2元素区间。
中间部分为1元素区间。
用j从头开始扫描顺序表L中部的所有元素。
j指向元素1：说明它属于中部，保持不动，j++。 
j指向元素0：说明它属于前部，i增1（扩大0元素区间），将i、j位置的元素交
换，j++。 
j指向元素2：说明它属于后部，k减1（扩大2元素区间），将j、k位置的元素
交换，此时j位置的元素可能还要交换到前部，所以j不前进。
**/
void move(SqList **L)
{
    int i=-1,j=0,k=L->length;
    while(j<k)
    {
        if(L->data[j]==0)
        {
            i++;
            swap(L->data[i],L->data[i]);
        }
        else if(L->data[j]==2)
        {
            k--;
            swap(L->data[k],L->data[j]);
        }
        else
         j++;//L->data[j]==1;
    }
}